[
    {
        "jobType": "Academic Year",
        "positionTitle": "Office Assistant (Work Study Required)",
        "department": "Academic Resources Center",
        "location": "Daniels Hall",
        "studentsRequired": 4,
        "hoursPerWeek": 5,
        "federalFunding": true,
        "jobDescription": "The Office Assistants work at either the Office of Academic Advising front desk or at the Academic Resources Center front desk.  Office Assistants assist with greeting and signing in students, answering questions, and other administrative tasks as assigned.  4-5 hours per week required.\r\n\r\nJob Responsibilities:\r\n - Proactively greet visitors that enter the office, creating a welcome environment and displaying strong customer service skills\r\n - Log and sign students into their advising or tutoring appointments using TutorTrac\r\n - Direct students to the appropriate advisor or office\r\n - Some data entry or logging of information\r\n - May answer telephone\r\n - Additional administrative tasks as assigned\r\n",
        "requirements": "",
        "contact": "Teresa Geddis",
        "email": "tgeddis@wpi.edu",
        "phone": "5381"
    },
    {
        "jobType": "Academic Year",
        "positionTitle": "Peer Tutor",
        "department": "Academic Resources Center",
        "location": "Unity Hall, 5th Floor ",
        "studentsRequired": 30,
        "hoursPerWeek": 5,
        "federalFunding": false,
        "jobDescription": "Academic Resources Center (ARC) Tutors will tutor undergraduate courses. Tutors provide five hours per week of availability between the hours of 10am-9pm Monday-Thursday, Friday 10-5pm, and Sundays 12pm-9pm. Each tutor will offer a minimum of two hours after 5pm to help accommodate student availability and needs. All tutors receive College Reading & Learning Association (CRLA) training and certification which takes place the weekday prior to the start of each term. Tutors will report to the Associate Director of the Academic Resources Center. \r\n\r\nPosition Responsibilities: \r\nAttend and actively participate in training sessions the weekday before the start of each term and any additional training or meetings throughout the year. \r\nTutor five one-hour sessions per week throughout the term, with a minimum of two hours after 5pm. \r\nProvide superior service and utilize best practices in individual sessions; opportunity for small group tutoring (Math and Science Help \"MASH\") if interested. \r\nReview necessary course material for each tutoring session, including but not limited to syllabi, Canvas site (if available), course material, textbook, past notes, student-specific questions.\r\nCommunicate and support students on a one-on-one basis, tailoring resources and support to each students needs and learning styles.\r\nCommunicate with the ARC leadership staff (Associate Director and ARC Tutor Coordinators) on a regular basis to provide updates on tutoring sessions and any concerns \r\nProvide recommendations to students on additional academic assistance as appropriate and necessary. \r\nShare best practices regarding studying, note taking, test taking, problem solving, etc. \r\nBe familiar with TutorTrac and the ARC Canvas site. Regularly promote the ARC and its resources to students and the campus community. \r\nProvide additional support to ARC operations as needed (marketing, events, resources, problem set development, reporting, etc.) Opportunities to provide additional tutoring beyond five hours may present themselves based on student demand and need. ",
        "requirements": "Position is open to rising sophomores, juniors, and seniors. Undergraduate full-time students only. Interested students should be in good academic standing and be a successful overall student, with an exceptional record in math, physics, chemistry, biology, computer science, and/or engineering science. Strong communication skills, with an emphasis on verbal communication. Ability and interest in serving as a role model. Previous experience tutoring or providing academic support preferred. Experience facilitating and leading a group preferred. Tutors are expected to follow the WPI Student Code of Conduct and ensure any access to student information remains confidential which is in alignment with the Family Educational Rights and Privacy Act of 1974. Learn more about these policies at https://www.wpi.edu/about/policies.",
        "contact": "Lakeya Almeida",
        "email": "arc@wpi.edu",
        "phone": "5381"
    },
    {
        "jobType": "Academic Year",
        "positionTitle": "Clerk, Office assistant.",
        "department": "Administrative Services",
        "location": "Boynton Hall LL",
        "studentsRequired": 4,
        "hoursPerWeek": 6,
        "federalFunding": true,
        "jobDescription": "Counter help, running files on our color and black and white copiers, along with their completion (Folding, cutting, mailing)Some computer work, binding, working with a PDF flow, along with other machines for the completion of the jobs, paper deliver in our building.",
        "requirements": "Very good customer service skills, some knowledge working in Adobe Creative Suites (Photoshop, Indesign, and Illustrator) not a needed requirement, but it would be helpful.",
        "contact": "Chad Farrell",
        "email": "cfarrell@wpi.edu",
        "phone": "5571"
    },
    {
        "jobType": "Academic Year",
        "positionTitle": "BBT-Laboratory Assistant",
        "department": "Biology & Biotechnology",
        "location": "Gateway Park - 4th floor",
        "studentsRequired": 1,
        "hoursPerWeek": 5,
        "federalFunding": true,
        "jobDescription": "Laboratory assistant to help with research laboratory activities, including microscopy, tissue culture, preparation of media, autoclaving, washing glassware, and molecular techniques. \r\nStudents interested in developing a foundation for future research are encouraged to apply.  The work in this lab will provide opportunities for long-term research projects in biology and biotechnology.",
        "requirements": "No previous experience is necessary. Candidates should be very responsible, committed, and good team members.",
        "contact": "Luis Vidali",
        "email": "lvidali@wpi.edu",
        "phone": "4194"
    },
    {
        "jobType": "Academic Year",
        "positionTitle": "Bioprocessing Assistant",
        "department": "Biology & Biotechnology",
        "location": "Gateway Park",
        "studentsRequired": 4,
        "hoursPerWeek": 5,
        "federalFunding": true,
        "jobDescription": "Highly motivated undergraduate students, especially those majoring in Biology & Biotechnology, Biochemistry, Biomedical Engineering, or Chemistry, etc. are invited to apply for the position in the Bio-Process Center. Students will work on projects from industry and academia relevant to the bioprocess development and material generation and analysis such as the construction of working cell bank, various fermentation and primary harvest, cell disruption, protein expression and purification, HPLC analysis and purification, etc.",
        "requirements": "The position requires mathematics, biological understanding, mechanical ability and some manual lifting and dexterity, excellent work ethic, ability to work collaboratively in a team environment and work alone.",
        "contact": "Longkuan Xiang",
        "email": "lxiang@wpi.edu",
        "phone": "5972"
    },
    {
        "jobType": "Academic Year",
        "positionTitle": "Laboratory Assistant",
        "department": "Biology & Biotechnology",
        "location": "Gateway Park",
        "studentsRequired": 1,
        "hoursPerWeek": 5,
        "federalFunding": true,
        "jobDescription": "The Manning Lab in the Biology and Biotechnology Department is looking to hire a student laboratory assistant. This is a federal work-study position with a time expectation of 3-5 hours per week (a fixed schedule each term is required but flexibility will be provided during exam/project due dates, etc). Although the position will require the student to work independently or alongside lab personnel, no prior research experience is necessary, as on-the-job training will be provided. Initial responsibilities will include managing lab inventory, restocking shelves, and reagent preparation with additional training in molecular and cellular approaches are possible for the interested student.\r\n\r\nDuties:\r\n•\tInventory, re-order, and restock laboratory supplies\r\n•\tClean and organize laboratory equipment and glassware\r\n•\tPrepare sterile media and solutions\r\n•\tKeep lab spaces stocked and clean\r\n•\tPossible: Assist senior research personnel with experiments (after a training period)\r\n\r\n",
        "requirements": "",
        "contact": "Prof. Amity Manning",
        "email": "almanning@wpi.edu",
        "phone": "4961"
    },
    {
        "jobType": "Academic Year",
        "positionTitle": "Laboratory Assistant",
        "department": "Biology & Biotechnology",
        "location": "Gateway Park",
        "studentsRequired": 1,
        "hoursPerWeek": 5,
        "federalFunding": true,
        "jobDescription": "The Manning Lab in the Biology and Biotechnology Department is looking to hire a student laboratory assistant to assist with mouse studies. This is a federal work-study position with a time expectation of 3-5 hours per week (a fixed schedule each term is required but flexibility will be provided during exam/project due dates, etc). Previous experience and comfort working in the vivarium is strongly encouraged as this position will require the student to handle mice.\r\n\r\nDuties:\r\n•\tSet up and monitor animal breeding cages\r\n•\tGenotype animals to be used in tumor studies\r\n•\tProcess and perform molecular assays on tissue samples\r\n",
        "requirements": "",
        "contact": "Prof. Amity Manning",
        "email": "almanning@wpi.edu",
        "phone": "4961"
    },
    {
        "jobType": "Academic Year",
        "positionTitle": "Laboratory Assistant",
        "department": "Biology & Biotechnology",
        "location": "Gateway Park",
        "studentsRequired": 2,
        "hoursPerWeek": 5,
        "federalFunding": true,
        "jobDescription": "The Farny Lab at Worcester Polytechnic Institute is looking to hire a student laboratory assistant. This is a federal work-study position with a time expectation of 3-5 hours per week (flexibility will be provided during exam/project due dates, etc). No specific laboratory skills or experience is necessary. We will train students as required. The Farny Lab is a welcoming environment. We seek colleagues that are dedicated to diversity, equity, and inclusion in STEM, and who will contribute to our climate of respect and dignity for all people.\r\nDuties:\r\n•\tInventory, manage, and re-order laboratory supplies\r\n•\tClean and organize laboratory equipment and glassware\r\n•\tPrepare sterile media and solutions\r\n•\tKeep lab spaces stocked and clean\r\n•\tAttend lab meetings (as academic schedule permits)\r\n•\tLearn basic microbial culture techniques, and assist senior personnel with experiments (after a training period)\r\n\r\n\r\n",
        "requirements": "",
        "contact": "Prof. Natalie Farny",
        "email": "nfarny@wpi.edu",
        "phone": "6511"
    },
    {
        "jobType": "Academic Year",
        "positionTitle": "Lab Assistant",
        "department": "Biomedical Engineering",
        "location": "Gateway- 60 Prescott st",
        "studentsRequired": 1,
        "hoursPerWeek": 5,
        "federalFunding": true,
        "jobDescription": "Looking for a Laboratory Assistant to aid in lab work and maintenance including but not limited to:\r\n-lab cleaning and tidying\r\n-dishes (cleaning and putting away)\r\n-autoclaving\r\n-solution making\r\n-plate pouring\r\n-assisting Lab Manager as needed",
        "requirements": "",
        "contact": "Professor Dirk Albrecht",
        "email": "dalbrecht@wpi.edu",
        "phone": "N/A"
    },
    {
        "jobType": "Academic Year",
        "positionTitle": "Office Assistant",
        "department": "Biomedical Engineering",
        "location": "Gateway 1 - Prescott Street",
        "studentsRequired": 1,
        "hoursPerWeek": 5,
        "federalFunding": true,
        "jobDescription": "MUST have Federal Work Study\r\n\r\nAssistant needed for a variety of office duties to include working with Excel spreadsheets and Word.\r\nFiling, printing/copying/scanning.\r\nOther duties as needed",
        "requirements": "Computer experience",
        "contact": "Lynda Hammett",
        "email": "lhammett@wpi.edu",
        "phone": "4112"
    },
    {
        "jobType": "Academic Year",
        "positionTitle": "Peer Well-Being Ambassadors (Work-Study required)",
        "department": "Center for Well-Being",
        "location": "Unity Hall",
        "studentsRequired": 10,
        "hoursPerWeek": 8,
        "federalFunding": true,
        "jobDescription": "Peer Well-being Ambassadors are students who are passionate about well-being and promoting a campus culture that supports the well-being of each member of the WPI community.  Working with the Center for Well-Being staff, students will gain direct experience with the CWB and develop skills in group facilitation, community outreach, communication, and knowledge of topics related to public health promotion and wellness.  \r\n \r\nPeer Well-Being Ambassadors will work in the Center for Well-Being and within the WPI community. Peer Well-Being Ambassadors have the option of becoming certified ProjectConnect Facilitators. \r\n\r\nApplications for Peer Well-Being Ambassadors are received on a rolling basis. We've hired non-work-study students, now accepting applications for ONLY federal work-study students.\r\n",
        "requirements": "",
        "contact": "Jermoh Kamara",
        "email": "cwb@wpi.edu",
        "phone": "6339"
    },
    {
        "jobType": "Academic Year",
        "positionTitle": "ChE Website Coordinator",
        "department": "Chemical Engineering",
        "location": "n/a",
        "studentsRequired": 1,
        "hoursPerWeek": 5,
        "federalFunding": true,
        "jobDescription": "Looking for a motivated student that would like to further their web development skills. Student will assist in updating ChE's departmental website that will include cataloging, updating and redesigning internal faculty notifications including departmental events, speakers, awards and publications. \r\n\r\nPlease apply  <a href=\"https://tinyurl.com/ChEWebsiteEditor2020\" target=\"_blank\">here</a>. \r\n",
        "requirements": "",
        "contact": "Leslie Brodeur",
        "email": "LBRODEUR@WPI.EDU",
        "phone": "5250"
    },
    {
        "jobType": "Academic Year",
        "positionTitle": "Chemistry Stockroom - FEDERAL WORKSTUDY",
        "department": "Chemistry & Biochemistry",
        "location": "GH114",
        "studentsRequired": 52,
        "hoursPerWeek": 7,
        "federalFunding": true,
        "jobDescription": "Provide Stockroom counter service to faculty, staff and student customers in CBC, CHE and other WPI departments. Process incoming packages, occassional errands, answer questions, dispense chemicals, update inventory, stock items.",
        "requirements": "",
        "contact": "Paula Moravek",
        "email": "pmoravek@wpi.edu",
        "phone": "5401"
    },
    {
        "jobType": "Academic Year",
        "positionTitle": "Abby Kelly Foster Charter School, Educational Aide -- FWS Requir",
        "department": "Community Service Center",
        "location": "Abby Kelley Elementary School 10 New Bon",
        "studentsRequired": 4,
        "hoursPerWeek": 4,
        "federalFunding": true,
        "jobDescription": "Desired Hours Per Week: T R 9-11 or 12-2 M W F 9-11 or 12-2 There are several volunteer opportunities throughout our school. We want someone who enjoys working with elementary age children. Our WPI volunteers in the past have been exceptional. They have supported small group math and ELA instruction. The teacher meets with them beforehand to review the materials and lesson. We also have volunteer opportunities for our specials' classes that include technology, art, music, physical education, and library. For more information, please contact Amy Emma at 508-854-8400 extension 3618",
        "requirements": "A resume would be required for interested applicants, along with an interview and a CORI is also completed on all volunteers who work with our students. This is completed at our school. We want people who enjoy working with children and who can share their interest in learning with our students. FWS Required",
        "contact": "Amy Emma",
        "email": "aemma@akfcs.org",
        "phone": "5088548400"
    },
    {
        "jobType": "Academic Year",
        "positionTitle": "African Community Education, After School Program Tutor -- FWS R",
        "department": "Community Service Center",
        "location": "484 Main St Worcester, MA",
        "studentsRequired": 10,
        "hoursPerWeek": 5,
        "federalFunding": true,
        "jobDescription": "Tutor & Activity Assistant Responsibilities: 1. Follow all requirements and minimum 2 hrs/wk for at least 3½ months with consistent weekly schedule and attendance. **If you have a set of required hours, come 2 hours per week for duration of semester. 2. Record arrival & departure time in ACE's After School binder and Fanning Building binder (if logging required hours, get Volunteer Coordinator signature on form) 3. Support positive student behavior (PBIS): Be Ready, Be Safe, Be Respectful, Be Responsible 4. Communicate with After School Program staff and Volunteer Coordinator regarding any concerns, challenges, or ideas for improvement. Tutoring Period: 5. Assist students with school homework assignments & projects on paper and computer 6. Engage students in academic enrichment resources, read together, or use ACE-approved computer programs when completed homework 7. Encourage students to become confident, independent learners by developing academic skills in: studying, organization, and time management Activity Period: 8. Assist activity and Leadership facilitators by explaining directions and providing examples in small group work 9. Encourage team play and demonstrate good sportsmanship and healthy choices",
        "requirements": "",
        "contact": "Ayman Abdelgadir",
        "email": "aabdelgadir@acechildren.org",
        "phone": "5084592284"
    },
    {
        "jobType": "Academic Year",
        "positionTitle": "AVID Tutor, Worcester Public Schools -- FWS Required",
        "department": "Community Service Center",
        "location": "Worcester Public Schools",
        "studentsRequired": 30,
        "hoursPerWeek": 10,
        "federalFunding": true,
        "jobDescription": "The AVID Program in the WPS is recruiting WPI students to tutor within the AVID elective class in all middle and high schools in Worcester. AVID is a program for students in grades 7-12 who are capable of completing a college preparatory program but need additional support and assistance. AVID is hiring throughout the school year and this year's tutor training is virtual and informal. AVID school placement can be within walking distance. Students will receive an AVID Certificate of Recognition upon completion of the program. A recommendation letter might be asked for upon request.",
        "requirements": "Must pass a CORI Education background check and attend an AVID Training session offered at the beginning of Term A - other training sessions may be scheduled later in the year as required. To receive the CORI form, please reach out to Janet Mathieu, whose contact information is listed here. ",
        "contact": "Janet Mathieu",
        "email": "mathieuj@worcesterschools.net",
        "phone": "5961"
    },
    {
        "jobType": "Academic Year",
        "positionTitle": "Communications Intern",
        "department": "Community Service Center",
        "location": "Greendale YMCA",
        "studentsRequired": 1,
        "hoursPerWeek": 10,
        "federalFunding": true,
        "jobDescription": "Flexible in scheduling the 5-10 hours per week.  Looking for a student with experience in social media marketing to create a plan, collect information from multiple departments throughout our organization, and create attractive and effective marketing materials.   ",
        "requirements": "All interested students would need to complete a comprehensive volunteer packet including a CORI/SORI for this position.  Students will need to have reliable computer and internet access to meet deadlines remotely.  Once a week there will be a 15-20 minute check-in with supervisor. ",
        "contact": "Jennie Backstrom",
        "email": "jbackstrom@ymcaofcm.org",
        "phone": "5961"
    },
    {
        "jobType": "Academic Year",
        "positionTitle": "Community Service Van Driver -- WPI SAO",
        "department": "Community Service Center",
        "location": "WPI",
        "studentsRequired": 2,
        "hoursPerWeek": 4,
        "federalFunding": false,
        "jobDescription": "Community Service Van Drivers will be responsible for transporting students to and from community service sites in Worcester and surrounding communities. Candidates for this position must have excellent driving skills and a valid drivers license and willingness to attend defensive driving course. Students will have a background check done and go through training with the Emergency Health and Safety (EHS) office\r\n\r\nYou can find the application is here: https://wpi.campuslabs.com/engage/submitter/form/start/408515",
        "requirements": "",
        "contact": "Mackenzie Lipman",
        "email": "mlipman@wpi.edu",
        "phone": "5961"
    },
    {
        "jobType": "Academic Year",
        "positionTitle": "Daytime Greeter 1, Mechanics Hall--FWS Required",
        "department": "Community Service Center",
        "location": "321 Main St",
        "studentsRequired": 2,
        "hoursPerWeek": 12,
        "federalFunding": true,
        "jobDescription": "The Daytime Greeter is responsible for greeting and assisting Mechanics Hall patrons and clients. As the first person that most visitors to the Hall will see and interact with, the Greeter plays a vital role in representing Mechanics Hall to the general public and shaping the public's perception of the quality of events and services at the Hall. The Greeter must be ready with a smile, have a friendly demeanor and be able to greet patrons and make them feel welcome. In addition, they should be aware of the building event schedule on each day they work so that they can direct patrons accordingly.\r\n \r\nGreet visitors entering the building and instruct/guide them to the appropriate space. \r\nObtain daily building event schedule information and be able to answer related patron questions.\r\nLearn basic historical information about the Hall and be able to have conversations with patrons about the building.  \r\nLearn about Mechanics Hall membership and member events and engage visitors in conversations about becoming members.\r\nAssist with small administrative projects as needed.",
        "requirements": "",
        "contact": "Chris Carney",
        "email": "ccarney@mechanicshall.org",
        "phone": "5961"
    },
    {
        "jobType": "Academic Year",
        "positionTitle": "Daytime Greeter 2, Mechanics Hall--FWS Required",
        "department": "Community Service Center",
        "location": "321 Main St",
        "studentsRequired": 2,
        "hoursPerWeek": 10,
        "federalFunding": true,
        "jobDescription": "The Daytime Greeter is responsible for greeting and assisting Mechanics Hall patrons and clients. As the first person that most visitors to the Hall will see and interact with, the Greeter plays a vital role in representing Mechanics Hall to the general public and shaping the public's perception of the quality of events and services at the Hall. The Greeter must be ready with a smile, have a friendly demeanor and be able to greet patrons and make them feel welcome. In addition, they should be aware of the building event schedule on each day they work so that they can direct patrons accordingly.\r\n \r\nGreet visitors entering the building and instruct/guide them to the appropriate space. \r\nObtain daily building event schedule information and be able to answer related patron questions.\r\nLearn basic historical information about the Hall and be able to have conversations with patrons about the building.  \r\nLearn about Mechanics Hall membership and member events and engage visitors in conversations about becoming members.\r\nAssist with small administrative projects as needed.",
        "requirements": "",
        "contact": "Chris Carney",
        "email": "ccarney@mechanicshall.org",
        "phone": "5961"
    },
    {
        "jobType": "Academic Year",
        "positionTitle": "Daytime Greeter 3, Mechanics Hall--FWS Required",
        "department": "Community Service Center",
        "location": "321 Main St",
        "studentsRequired": 2,
        "hoursPerWeek": 13,
        "federalFunding": true,
        "jobDescription": "Time: MWF 2pm-5pm + TTh 3pm-5pm (13hrs/week)\r\n\r\nThe Daytime Greeter is responsible for greeting and assisting Mechanics Hall patrons and clients. As the first person that most visitors to the Hall will see and interact with, the Greeter plays a vital role in representing Mechanics Hall to the general public and shaping the public's perception of the quality of events and services at the Hall. The Greeter must be ready with a smile, have a friendly demeanor and be able to greet patrons and make them feel welcome. In addition, they should be aware of the building event schedule on each day they work so that they can direct patrons accordingly.\r\n \r\nGreet visitors entering the building and instruct/guide them to the appropriate space. \r\nObtain daily building event schedule information and be able to answer related patron questions.\r\nLearn basic historical information about the Hall and be able to have conversations with patrons about the building.  \r\nLearn about Mechanics Hall membership and member events and engage visitors in conversations about becoming members.\r\nAssist with small administrative projects as needed.",
        "requirements": "",
        "contact": "Chris Carney",
        "email": "ccarney@mechanicshall.org",
        "phone": "5961"
    },
    {
        "jobType": "Academic Year",
        "positionTitle": "Front Desk Student Staff-- Technocopia -- FWS Required",
        "department": "Community Service Center",
        "location": "Technocopia",
        "studentsRequired": 2,
        "hoursPerWeek": 10,
        "federalFunding": true,
        "jobDescription": "Answer the door, phone, and greet Technocopia members and guests as they enter.  \r\nCheck voice and email. Check the calendar for events in the space.\r\nOversee student class check in. \r\nSupervise students and guests while they wait for class or a tour. \r\nMaintain tidiness of the lounge and front area, \r\nTend to supply needs for the hand washing stations, and cleaning supplies.\r\nHave a basic comprehension of shop structures, and FAQ on machines and tools. \r\nHelp Technocopia with efficiencies on answering FAQ and member needs.\r\nGive tours of Technocopia to visiting guests.\r\n\r\n",
        "requirements": "All staff will need to take a 1 hour orientation to become acquainted with this role before beginning.",
        "contact": "Lauren Monroe",
        "email": "lauren.monroe@technocopia.org",
        "phone": "5961"
    },
    {
        "jobType": "Academic Year",
        "positionTitle": "Habitat for Humanity ReStore Volunteer Sales Associate -- FWS Re",
        "department": "Community Service Center",
        "location": "11 Distributor Road, Worcester MA 01605",
        "studentsRequired": 10,
        "hoursPerWeek": 4,
        "federalFunding": true,
        "jobDescription": "Volunteers are responsible for the day-to-day type retail related responsibilities and operations of the Habitat for Humanity ReStore. The purpose of the ReStore is to sell a wide selection of donated new and gently used quality home furnishings and building materials. Proceeds benefit the construction of houses in the area served by Habitat for Humanity MetroWest/Greater Worcester. Volunteers will interact with the general public and all levels of management. 1 Customer service: Include answering customer and donor questions, assisting customers with their purchases, greeting customers. 2 Merchandising: Assist staff and other volunteers to prepare appropriate space for incoming items. Facilitating the logical and attractive display of merchandise. Arrange priced items on the sales floor. 3 Donations Processing: Assist donors when making a drop of donation and provide donations receipts. Unload donations from vehicles. Clean, test, sort and price incoming donations Volunteers are expected to participate in a mandatory volunteer orientation session.Shifts time can be flexible with prior approval. Contract Molly Pietrantonio at 508-799-9259 x113",
        "requirements": "Must have a willingness to learn and the ability to work with a diverse group of people. Retail experience is encouraged but not necessary! It will also be necessary for this position to communicate effectively. Federal Work Study Required",
        "contact": "Molly Pietrantonio",
        "email": "molly.pietrantonio@habitatmwgw.org",
        "phone": "5087999259"
    },
    {
        "jobType": "Academic Year",
        "positionTitle": "Mechanics Hall -- Video Editor -- FWS Required",
        "department": "Community Service Center",
        "location": "321 Main St",
        "studentsRequired": 1,
        "hoursPerWeek": 10,
        "federalFunding": true,
        "jobDescription": "We are looking for a Video Editor to assemble recorded concert footage into a finished project that matches the director’s vision and is suitable for viewing on Youtube. Ultimately, as a Video Editor, you should be able to bring sight and sound together to tell a cohesive story.\r\n\r\nManipulate and edit film pieces in a way that is invisible to the audience\r\nGrasp production and marketing team’s needs and specifications\r\nTrim footage segments and put together the sequence of the film\r\nInput music, dialogues, graphics and effects\r\nCreate rough and final cuts\r\nEnsure logical sequencing and smooth running\r\nDiscover and implement new editing technologies and industry’s best practices to maximize efficiency",
        "requirements": "",
        "contact": "Chris Carney",
        "email": "ccarney@mechanicshall.org",
        "phone": "5961"
    },
    {
        "jobType": "Academic Year",
        "positionTitle": "Mentor, Exploradreams Robokids",
        "department": "Community Service Center",
        "location": "WPI Campus",
        "studentsRequired": 20,
        "hoursPerWeek": 2,
        "federalFunding": true,
        "jobDescription": "Activities include tutoring and mentoring grade-school students in math and science and assisting them in recreational activities. An orientation and training are provided. Work hours are during weekdays only. The weekly Exploradreams program is usually held on campus on Tuesdays and Thursdays from 4-6pm.",
        "requirements": "Requirements include the ability to work with and follow directions from staff and/or peers and a desire to work with children is a must. Good communication skills and a willingness to share your knowledge in math and science are essential.",
        "contact": "Mackenzie Lipman",
        "email": "mlipman@wpi.edu",
        "phone": "5961"
    },
    {
        "jobType": "Academic Year",
        "positionTitle": "Pakachoag Music School -- Communication Intern -- FWS Required",
        "department": "Community Service Center",
        "location": "10 Irving St/Remote",
        "studentsRequired": 1,
        "hoursPerWeek": 5,
        "federalFunding": true,
        "jobDescription": "Position Open - Communication Intern: The Communication Intern will assist in coordinating and managing the school’s social media marketing and communications strategy, support fundraising events, and assist with other development related tasks. In this role, the Communication Intern will have the opportunity to develop his/her project management, content creation, and to increase visibility of the school and generate a following of people who have an interest in Pakachoag. \r\nThe Communication Intern will assist with weekly communication strategy and creation of weekly social media postings (at least 3 posts/week).\r\nKey Responsibilities:\r\nCreating 90-day calendar for Social Media accounts Facebook, Instagram, and Twitter \r\nGraphic design projects as assigned \r\nAssist with preparing promotional bulk-mailings \r\nDesign materials for print, website, and social media \r\nMaintain social media platforms through engaging with audiences and other organizations\r\nSupport marketing campaigns by capturing photographs and videos \r\n",
        "requirements": "",
        "contact": "Jacob Walz",
        "email": "jacob@pakmusic.org",
        "phone": "5961"
    },
    {
        "jobType": "Academic Year",
        "positionTitle": "Pakachoag Music School -- Volunteer Door Monitor -- FWS Required",
        "department": "Community Service Center",
        "location": "10 Irving St",
        "studentsRequired": 1,
        "hoursPerWeek": 6,
        "federalFunding": true,
        "jobDescription": "The primary responsibilities of the Door Monitor are to monitor all visitor and participant entry and exit, following all safety protocols. The volunteer door monitor will be stationed in the front office of the building so they will act as the first contact person for the school. Training will be provided on site. \r\nThe position is 3-6 hours a week. We will usually need the window of 9:00am-3:15pm covered every Saturday and hours are up to the individual. Potential shifts include 9:00am-12:00pm and 12:00pm-3:15pm Saturday. Hours may vary based on scheduling needs. \r\nResponsibilities:                   \r\nAct as first person contact for new and returning music students \r\nMonitor who comes in and out of the building \r\nMake sure incoming students sign health and wellness form \r\nAssist families finding their class as needed \r\n",
        "requirements": "",
        "contact": "Jacob Walz",
        "email": "jacob@pakmusic.org",
        "phone": "5961"
    },
    {
        "jobType": "Academic Year",
        "positionTitle": "Shelter Assistant, Worcester Animal Rescue League -- FWS Require",
        "department": "Community Service Center",
        "location": "139 Holden Street",
        "studentsRequired": 1,
        "hoursPerWeek": 5,
        "federalFunding": true,
        "jobDescription": "Activities include tending to the care and maintenance of the pets in the shelter. Duties may include cleaning kennels and cages, laundry, washing dishes and litter boxes. Additional duties may include sorting food, transporting donations, bathing pets, extreme cleaning. Animal interaction may be limited. Must be able to lift 40 pounds. An orientation and training are provided. Work hours are may be flexible with more help needed between 8-11 a.m. No nights or Sundays.",
        "requirements": "The ideal candidate will have reliable attendance and transportation. Requirements: Ability to work with and follow directions from staff and/or volunteers and a desire to work with pets is a must. Previous shelter or animal experience preferred. Must be ready to work hard in dirty situations. Be aware that clothing may be stained, ripped, dirty, etc. Waterproof boots and extra socks are highly recommended.",
        "contact": "Allie Simone",
        "email": "WARLvolunteer@gmail.com",
        "phone": "508-853-00"
    },
    {
        "jobType": "Academic Year",
        "positionTitle": "Special Assistant to Executive Director, Greater Worcester Land",
        "department": "Community Service Center",
        "location": "101 Water Street",
        "studentsRequired": 2,
        "hoursPerWeek": 2,
        "federalFunding": true,
        "jobDescription": "This would entail a variety of office related and technical projects for the Greater Worcester Land Trust. The person would work directly with the Executive Director, and occasionally with the Volunteer and Membership Coordinator.",
        "requirements": "",
        "contact": "Mary Caulway",
        "email": "mary@gwlt.org",
        "phone": "5087953838"
    },
    {
        "jobType": "Academic Year",
        "positionTitle": "Student Data Manager-- Net of Compassion -- FWS Required",
        "department": "Community Service Center",
        "location": "44 Vernon St; 674 Main St",
        "studentsRequired": 1,
        "hoursPerWeek": 10,
        "federalFunding": true,
        "jobDescription": "Net of Compassion is seeking a student skilled in data collection, management, and analysis to collect relevant data about our service programs for people experiencing homelessness, to amalgamate and digitize past data, and develop systems for their timely and accurate digital collection going forward.  Success in this position will result in an accurate, thorough, and up-to-date record of the number of people served by our programs, meals and clothes distributed, showers provided, and referrals to recovery programs made on a daily, weekly, and total basis.\r\n\r\nResponsibilities and Duties:\r\n-Assist and train Net of Compassion staff in collecting data on people served and services provided for several of our programs\r\n-Develop, where necessary, a system for storing amalgamated data digitally\r\n-Digitize and amalgamate past data contained in paper records, while safeguarding protected and identifying information.\r\n-Ensure Net of Compassion has accurate, up-to-date, and usable data that can be utilized for grant writing, promotion, and reporting to funders.\r\n-Work collaboratively with Net of Compassion staff and volunteers\r\n-Treat each service recipient with care, compassion, and respect",
        "requirements": "***Hours are dependent on student's Financial Aid",
        "contact": "Brian Ashmankas",
        "email": "bashmankas@netofcompassion.org",
        "phone": "5961"
    },
    {
        "jobType": "Academic Year",
        "positionTitle": "Various Internship Opportunities, Community Harvest Project -- F",
        "department": "Community Service Center",
        "location": "37 Wheeler Road Grafton, MA",
        "studentsRequired": 3,
        "hoursPerWeek": 5,
        "federalFunding": true,
        "jobDescription": "While our organization is deeply committed to building a sustainable food system, we do not require candidates to be well versed in agriculture or the food production system. Bring your enthusiasm, and we will teach you the rest! The majority of your time will be spent instructing volunteers and ensuring a positive experience for our volunteer groups, most of which are local school groups in the fall and spring. Since we are a small non-profit, we are able to utilize your talents and interests. The remainder of your time is flexible; we have needs in development, social media, marketing, volunteer relations, or database administration. We're also open to other projects provided they advance our organization.",
        "requirements": "n/a",
        "contact": "Paul Grady",
        "email": "volunteer@community-harvest.org",
        "phone": "774-551-65"
    },
    {
        "jobType": "Academic Year",
        "positionTitle": "AI Project Worker",
        "department": "Computer Science",
        "location": "Unity Hall 320",
        "studentsRequired": 5,
        "hoursPerWeek": 4,
        "federalFunding": true,
        "jobDescription": "Project workers will be a part of an AI-project that analyzes students' math homework uploaded to a digital platform. Candidates will check and annotate over 100,000 images of math homework for personally identifiable information or PII. The work itself will be rote, but you'll be part of a fascinating research project in the congenial Learning Sciences lab in Unity Hall. In the past, when work-study hours run out, we have hired exceptional students to stay on for summer and semester internships.  ",
        "requirements": "We are looking for someone who is prompt, well-organized, and dogged. Most importantly, attention-to-detail will be crucial for the project work.",
        "contact": "Angela Kao",
        "email": "akao@wpi.edu",
        "phone": "6470"
    },
    {
        "jobType": "Academic Year",
        "positionTitle": "Computer Scientist-Federal Work Study",
        "department": "Computer Science",
        "location": "Gateway Park GP4018",
        "studentsRequired": 1,
        "hoursPerWeek": 5,
        "federalFunding": true,
        "jobDescription": "Seeking a Computer Science or Bioinformatics and Computational Biology major to work on computational models of cells. The student will collaborate with other students from Biology and Biotechnology and Biochemistry majors to implement models at different scales.  The work will provide a valuable foundation for future interdisciplinary projects.",
        "requirements": "Applicants should be familiar with a basic programming language. Suggested languages are R, MATLAB, or Python.  ",
        "contact": "Prof. Luis Vidali",
        "email": "lvidali@wpi.edu",
        "phone": "4194"
    },
    {
        "jobType": "Academic Year",
        "positionTitle": "Ed Psych & Math Lab Assistant",
        "department": "Computer Science",
        "location": "SL",
        "studentsRequired": 6,
        "hoursPerWeek": 10,
        "federalFunding": true,
        "jobDescription": "The Education Psychology and Mathematics Learning Lab is hiring students to work with our team of researchers. We design and develop new dynamic technology-based tools for mathematics teaching and learning (Graspable Math and the Wearable Learning Cloud Platform) and conduct classroom-based research examining the effectiveness of these interventions. We need students that can help assist with all aspects of the research including creating and implementing study content and materials, data collection in the laboratory and schools, and supporting dissemination through a website and professional development with teachers. ",
        "requirements": "Organization and attention to detail",
        "contact": "Tricia Desmarais",
        "email": "td@wpi.edu",
        "phone": "6470"
    },
    {
        "jobType": "Academic Year",
        "positionTitle": "Laboratory Assistant - Interaction Lab",
        "department": "Computer Science",
        "location": "Fuller Laboratories",
        "studentsRequired": 4,
        "hoursPerWeek": 5,
        "federalFunding": true,
        "jobDescription": "Lab assistant will facilitate and coordinate multiple research projects with the highest level of organization and commitment. Responsibilities will depend on student's background and interest. This may include: 1) assisting in the designing, prototyping, developing, evaluating novel interfaces, and exploring sensors 2) coordinating, experiments with human subjects to advance human-computer interaction research 3) developing robust software following best practices in software engineering (Java, Python, Matlab, D3, Javascript) for visualizing and analyzing data 4) statistical (Matlab, SPSS, Excel) and other analytic work 5) maintaining lab website and online presence, 6) coordinating lab meetings and visitors 7) conducting literature reviews.\r\n\r\nAbout the lab:\r\nDr. Solovey's lab conducts research in human-computer interaction, with a focus on next-generation interaction techniques, such as brain-computer interfaces, physiological computing, and reality-based interaction. We design, build and evaluate interactive computing systems that use machine learning approaches to adapt and support the user's changing cognitive state and context. We also investigate effective human interaction with complex and autonomous systems and vehicles. Our work has applications in areas such as education, transportation, medicine, creativity support, gaming, and complex decision making.",
        "requirements": "We are looking for someone who is interested in human-computer interaction and that has these qualities: flexible, adaptive, proactive, persistent, organized, efficient, good with time management, enthusiastic, detail-oriented, excellent listening skills, openness to ideas, team player. Programming skills (Java, Python, Matlab, D3, etc.) desired but not required. Interest in machine learning, neuroscience and/or  autonomous systems is also a plus, as these are also key topics in the research lab.",
        "contact": "Professor Erin Solovey",
        "email": "esolovey@wpi.edu",
        "phone": "6936"
    },
    {
        "jobType": "Academic Year",
        "positionTitle": "Office Assistant ",
        "department": "Computer Science",
        "location": "Fuller Labs Rm 233",
        "studentsRequired": 4,
        "hoursPerWeek": 5,
        "federalFunding": true,
        "jobDescription": "Filing, printing/copying/scanning, mailing and mail processing; delivering or picking up sensitive documents around campus; walking visitors around campus; computer work, along with other machines for the completion of tasks; occasional proofreading and/or editing work; general office maintenance. ",
        "requirements": "",
        "contact": "Katherine Crighton",
        "email": "kjcrighton@wpi.edu",
        "phone": "5678"
    },
    {
        "jobType": "Academic Year",
        "positionTitle": "Additive Manufacturing Lab Assistant, PracticePoint",
        "department": "Corporate and Professional Education",
        "location": "50 Prescott Street, Suite 3700",
        "studentsRequired": 8,
        "hoursPerWeek": 5,
        "federalFunding": true,
        "jobDescription": "Basic Responsibilities include: Assisting users with the operation of the additive manufacturing tools including the 3D printers and laser cutters, handling 3D priniting requests from users by keeping an organized queue of parts and ensuring they get printed in the order they are received, assisting with some post-processing of 3D printed parts by removing support material along with sanding and painting when requested, and keeping track of material inventory.",
        "requirements": "Should have some prior experience with 3D printing and Laser cutting. Training will be provided for the specific machines in the lab.",
        "contact": "Christopher Nycz",
        "email": "cjnycz@wpi.edu",
        "phone": "0"
    },
    {
        "jobType": "Academic Year",
        "positionTitle": "Machine Shop Assistant, PracticePoint ",
        "department": "Corporate and Professional Education",
        "location": "50 Prescott Street, Suite 3700",
        "studentsRequired": 8,
        "hoursPerWeek": 5,
        "federalFunding": true,
        "jobDescription": "Basic responsibilities include: Assisting lab users with the operation of the machines (drills, saws, lathes, and CNC machines). Keeping track of inventory and ensuring the lab stays clean and organized. Consulting with users about how to manufacture their designs. ",
        "requirements": "Should have some prior machining experience. Training will be provided for the specific machines in the lab. ",
        "contact": "Christopher Nycz",
        "email": "cjnycz@wpi.edu",
        "phone": "0"
    },
    {
        "jobType": "Academic Year",
        "positionTitle": "Office Assistant",
        "department": "Corporate and Professional Education",
        "location": "50 Prescott Street, Suite 2400",
        "studentsRequired": 1,
        "hoursPerWeek": 5,
        "federalFunding": true,
        "jobDescription": "Biomanufacturing Education and Training Center.  Assisting the Admin Assistant in preparing training packets, such as name badges, sign in sheets, certificates of completion, etc.  Consolidation of information onto excel spreadsheets and inputting information into Sales Force, our Customer Relationship Management software.  Other tasks as needed.  We need a real team-player who is willing to jump in to ensure the success of the center.",
        "requirements": "Proficient in Excel and Microsoft Office.  Friendly team-player who is good with details.  ",
        "contact": "Susan Fischer",
        "email": "sfischer@wpi.edu",
        "phone": "4879"
    },
    {
        "jobType": "Academic Year",
        "positionTitle": "Barista",
        "department": "Dining Services",
        "location": "Founders Hall",
        "studentsRequired": 4,
        "hoursPerWeek": 20,
        "federalFunding": false,
        "jobDescription": "Work as a Barista in Starbucks on Campus making coffees and drinks and doing cashier and other duties",
        "requirements": "",
        "contact": "Bernadette t Grady",
        "email": "bgrady@wpi.edu",
        "phone": "5088686670"
    },
    {
        "jobType": "Academic Year",
        "positionTitle": "Barista",
        "department": "Dining Services",
        "location": "founders Hall",
        "studentsRequired": 6,
        "hoursPerWeek": 20,
        "federalFunding": false,
        "jobDescription": "Barista @Starbucks at Founders Hall",
        "requirements": "",
        "contact": "Bernadette t Grady",
        "email": "bgrady@wpi.edu",
        "phone": "5684"
    },
    {
        "jobType": "Academic Year",
        "positionTitle": "GLOBAL ENGAGER-WEB DEVELOPER",
        "department": "Global-Lab",
        "location": "Remote & Foisie Innovation Center",
        "studentsRequired": 7,
        "hoursPerWeek": 10,
        "federalFunding": false,
        "jobDescription": "Global Engagers-Web Developers at the Global Lab will be responsible for designing and building web pages that showcase Global Lab work for external audiences, leading social media communication and outreach, designing and maintaining the Canvas site for internal WPI audiences, and creating graphic design for newsletters, posters and other outreach activities. Web developers will also advance the Lab’s transmedia storytelling capacities by pursuing novel, creative, innovative forms of web-based communication. \r\n",
        "requirements": "",
        "contact": "Global Lab Co-Directors",
        "email": "gr-global-lab@wpi.edu",
        "phone": "6684"
    },
    {
        "jobType": "Academic Year",
        "positionTitle": "Global Engagers-Media Assistants",
        "department": "Global-Lab",
        "location": "Global Lab - Foisie Innovation Studio",
        "studentsRequired": 5,
        "hoursPerWeek": 10,
        "federalFunding": false,
        "jobDescription": "Global Engagers-Media Assistants will provide global engagement and/or creative media support to faculty, staff and students in the Global Lab in the Foisie Innovation Studio and online.  \r\n\tMedia Assistants will help support the innovative, collaborative and inclusive culture in the Global Lab through trainings, special events and media productions that elevate the importance and visibility of WPI’s global programs and research. \r\nSpecifically, Media Assistants may assist with tasks such as:\r\n•\tproducing podcasts, short videos, green screen, 360-degree camera, photography  and other media productions\r\nplanning and facilitating events focused on global engagement\r\n•\tconducting in-person or online media training sessions with students and faculty on audio, visual and/or AR/VR production hardware and software\r\n•\thelping to promote Lab programs and events around campus\r\n•\tproviding drop-in support in the media studios \r\n•\tproviding peer-to-peer media consultations\r\n\r\nTraining on specific technologies is provided by ATC and Global Lab staff. \r\n\r\n\r\n",
        "requirements": "",
        "contact": "Global Lab Co-Directors ",
        "email": "gr-global-lab@wpi.edu",
        "phone": "6268"
    },
    {
        "jobType": "Academic Year",
        "positionTitle": "GLOBAL LAB AUDIO SPECIALIST",
        "department": "Global-Lab",
        "location": "Global Lab",
        "studentsRequired": 2,
        "hoursPerWeek": 10,
        "federalFunding": false,
        "jobDescription": "Global Lab Audio Specialists will be responsible for production and post-production of Global Lab podcasts and audio elements related to creative scholarship projects. This is primarily an audio-intensive position, but video production and post-production skills are also welcome.\r\n\r\nAudio specialists should have intermediate-to-advanced audio recording and editing skills using a range of hardware and software including the operation of field and studio recording equipment, and use of audio editing programs such as Reaper, Audition, and/or Audacity, etc.\r\n\r\nAudio specialists will work with Global Lab co-directors, Global Lab Faculty Fellows, DIGS and other faculty members and student project teams. In addition to audio production and post-production, audio specialists may be asked to provide training in:\r\no\tStudio Audio Training (and *Video Training if applicable)\r\no\tPodcasting/Audio Techniques\r\no\tAudio Editing/Post-Production\r\no\t*Video Editing/Post-Production (including Premier & Camtasia) if applicable\r\no\tUse of smartphones and other devices for field recording \r\no\tField Production & Field Kit use\r\no\tCreating compelling audio elements for IQP & MQP Reports\r\no\tOther trainings determined with Global Lab directors \r\n\t \r\nAudio specialists will be part of a Global Lab Specialty Team to:\r\no\tAssist with projects such as showcases, demos, dialogues and events\r\no\tServe as production assistants for audio portions of storyworld productions\r\no\tProduce Global Lab podcasts\r\n\r\nAdditional duties include participating on the Global Lab team, attending and contributing to team meetings, maintaining Lab facilities, re-setting Lab spaces, troubleshooting, tracking equipment, etc.\r\n\r\nInterested? Send email and resume to: GR-Global-Lab@WPI.edu\r\n",
        "requirements": "Audio specialists should have intermediate-to-advanced audio recording and editing skills using a range of hardware and software including the operation of field and studio recording equipment, and use of audio editing programs such as Reaper, Audition, and/or Audacity, etc.",
        "contact": "Global Lab Directors",
        "email": "GR-Global-Lab@WPI.edu",
        "phone": "6444"
    },
    {
        "jobType": "Academic Year",
        "positionTitle": "GLOBAL LAB VIDEO SPECIALIST",
        "department": "Global-Lab",
        "location": "Global Lab",
        "studentsRequired": 2,
        "hoursPerWeek": 11,
        "federalFunding": false,
        "jobDescription": "Global Lab Video Specialists will be responsible for studio video production, field production and video post-production for the Global Lab.\r\n\r\nVideo Specialists should have intermediate-to-advanced video recording and editing skills using a range of hardware and software including the operation of field and studio recording equipment, and use of video editing programs including Adobe Premier, etc.\r\n\r\nVideo Specialists will work primarily with Global Lab co-directors, Global Lab Faculty Fellows, DIGS and other faculty members on special projects. \r\n\r\nVideo Specialists should have experience in:\r\no\tStudio Video (and audio) Production\r\no\tField Video Production \r\no\tVideo Editing/Post-Production (including Premier & Camtasia)\r\no\tBasics of Videography/Photography\r\no\tUse of Green Screens in production and post-production\r\no\tSmartphone Movie-making\r\no\tFamiliarity with 360-degree camera is a plus\r\no\tField Kit training for student teams\r\no\tOther trainings determined with Global Lab directors \r\n\t \r\nVide Specialists will be part of a Global Lab Specialty Team to:\r\no\tAssist with projects such as showcases, demos, dialogues and events\r\no\tServe as production assistants for storyworld productions\r\n\r\nAdditional duties include participating on the Global Lab team, attending and contributing to team meetings, maintaining Lab facilities, re-setting Lab spaces, troubleshooting, tracking equipment, etc.\r\n\r\nInterested? Send email and resume to: GR-Global-Lab@WPI.edu\r\n",
        "requirements": "Video Specialists should have intermediate-to-advanced video recording and editing skills using a range of hardware and software including the operation of field and studio recording equipment, and use of video editing programs including Adobe Premier, etc.",
        "contact": "Global Lab Directors",
        "email": "GR-Global-Lab@WPI.edu",
        "phone": "6444"
    },
    {
        "jobType": "Academic Year",
        "positionTitle": "archiving associate",
        "department": "Humanities & Arts",
        "location": "01606",
        "studentsRequired": 6,
        "hoursPerWeek": 5,
        "federalFunding": true,
        "jobDescription": "handling, cataloging, transfer, and editing of materials for an online museum, WPI's Jazz History Database. Your good work will be reflected in our online presence.\r\n",
        "requirements": "all skill levels welcome; no experience necessary in Jazz or any sort of music. Training will be on-the-job. Specialized work is available to students with particular skills in audio or video editing, web design, php, social media communications.",
        "contact": "Ben Young",
        "email": "byoung2@wpi.edu",
        "phone": "4981"
    },
    {
        "jobType": "Academic Year",
        "positionTitle": "Choir Librarian",
        "department": "Humanities & Arts",
        "location": "First Baptist Church",
        "studentsRequired": 2,
        "hoursPerWeek": 0,
        "federalFunding": true,
        "jobDescription": "Work with the WPI Choirs to organize, sort, and keep track of the choir's music library. There is flexibility in the number of hours per week and at what time the work should take place.\r\n\r\nAnyone may apply, though we hope to hire students who are also interested in singing with the choirs. Please contact Professor Rohde (jwrohde@wpi.edu) for more information.",
        "requirements": "",
        "contact": "Professor Joshua Rohde",
        "email": "jwrohde@wpi.edu",
        "phone": "5051"
    },
    {
        "jobType": "Academic Year",
        "positionTitle": "Choral Division Webmaster",
        "department": "Humanities & Arts",
        "location": "Alden 205",
        "studentsRequired": 2,
        "hoursPerWeek": 10,
        "federalFunding": true,
        "jobDescription": "Must Have Federal Workstudy.  Student needed for 6 - 10 hours \r\nper week for updating Choral Music webpages.   Must be \r\navailable on Thursdays from 5.30 - 6.30pm for weekly meetings \r\nwith Music Association officers.",
        "requirements": "",
        "contact": "John Delorey",
        "email": "jfd@wpi.edu",
        "phone": "5051"
    },
    {
        "jobType": "Academic Year",
        "positionTitle": "Music Technology Database / Website",
        "department": "Humanities & Arts",
        "location": "Alden Hall",
        "studentsRequired": 1,
        "hoursPerWeek": 10,
        "federalFunding": true,
        "jobDescription": "We seek a full stack developer that can help build the front end and back end of a database / web-based UI that allows users to explore musical machines. This should be connected to the web properties of WPI's Music, Perception and Robotics Lab. ",
        "requirements": "Relevant skills: CSS, HTML, javascript, conceptual modeling, SQL Server.",
        "contact": "Scott Barton",
        "email": "sdbarton@wpi.edu",
        "phone": "5620"
    },
    {
        "jobType": "Academic Year",
        "positionTitle": "Music Wiki Editor and Site Migration Liaison (Requires Federal W",
        "department": "Humanities & Arts",
        "location": "Alden B30",
        "studentsRequired": 1,
        "hoursPerWeek": 10,
        "federalFunding": true,
        "jobDescription": "Go through each page at <A HREF=\"http://wiki.wpi.edu/vjmedia\">http://wiki.wpi.edu/vjmedia</A> and https://londonhuawiki.wpi.edu and check for/fix dead links. \r\n\r\nWork with Helpdesk to migrate first link (above) to a new mobile-friendly wiki site (manually formatting pages as needed). \r\n\r\nFederal Workstudy is required. ",
        "requirements": "Basic familiarly with Mediawiki editing https://m.mediawiki.org/wiki/Help:Categories ",
        "contact": "Prof. V.J. Manzo",
        "email": "vj@wpi.edu",
        "phone": "6575"
    },
    {
        "jobType": "Academic Year",
        "positionTitle": "Office Assistant",
        "department": "Humanities & Arts",
        "location": "SL ",
        "studentsRequired": 1,
        "hoursPerWeek": 10,
        "federalFunding": true,
        "jobDescription": "HUA Drama/Theatre is currently seeking a DT Office Assistant for the 2022-2023 academic year. \r\n \r\n\r\nResponsibilities may include: \r\n\r\nParticipating in weekly meetings and/or office hours.  \r\n\r\nManagement and archival of DT materials (books, scripts, production documents, projects, etc.) \r\n\r\nServing as a resource for fellow students on DT questions, such as academic requirements, production opportunities, etc. \r\n\r\nAssisting with departmental publicity, including website, social media, ticketing, posters, etc. \r\n\r\nOther projects and office tasks, as assigned by the DT faculty. ",
        "requirements": "No experience necessary.  ",
        "contact": "Patrick Crowe",
        "email": "pcrowe@wpi.edu",
        "phone": "na"
    },
    {
        "jobType": "Academic Year",
        "positionTitle": "Theatre Technical Assistant",
        "department": "Humanities & Arts",
        "location": "Little Theatre ",
        "studentsRequired": 1,
        "hoursPerWeek": 10,
        "federalFunding": true,
        "jobDescription": "Theatre Technical Assistant\r\n \r\nHUA Drama/Theatre is currently seeking a DT Theatre Technical Assistant for the 2022-2023 academic year. \r\n \r\nThis position will join our team of students who help with the theatre programs upkeep and maintenance of our spaces and equipment. \r\n \r\nParticipating in weekly meetings.  \r\nManagement and theatre spaces (Bookings, cleaning, repair, etc.) \r\n Assisting with long term space improvement projects (updating equipment, finding solutions to problems, etc) \r\nResponding to issues with spaces or equipment from Production staff.\r\nOther projects and office tasks, as assigned by the DT faculty. \r\n \r\n \r\n",
        "requirements": "",
        "contact": "Patrick Crowe",
        "email": "pcrowe@wpi.edu",
        "phone": "NA"
    },
    {
        "jobType": "Academic Year",
        "positionTitle": "Innovation Studio Workshop Leader",
        "department": "Innovation & Entrepreneurship",
        "location": "WPI Innovation Studio",
        "studentsRequired": 8,
        "hoursPerWeek": 6,
        "federalFunding": true,
        "jobDescription": "We're looking for passionate individuals to help others gain important skills through our Makerspace workshops. This job will also serve as an amazing opportunity to learn fabrication and design skills in a makerspace. We will teach you soldering, sewing, rotary tool operation, 3d printing, laser cutting, leatherworking and much more. We DO NOT require you to have these skills prior to being hired. Once you are confident with these skills you will begin to teach workshops to the student body. This job provides leadership, fabrication, and effective communication experience.\r\n \r\nApply here! --> https://forms.office.com/r/0SNemM1PKR",
        "requirements": "",
        "contact": "Adam Sears",
        "email": "asears@wpi.edu",
        "phone": "4638"
    },
    {
        "jobType": "Academic Year",
        "positionTitle": "Office Assistant, WPI Innovation Studio Office",
        "department": "Innovation & Entrepreneurship",
        "location": "WPI Innovation Studio",
        "studentsRequired": 4,
        "hoursPerWeek": 4,
        "federalFunding": true,
        "jobDescription": "Assist with clerical work as assigned by professional staff. (Clerical work includes, but is not limited to: creating basic flyers, data entry, word processing, filing, coordinating mailings, collating/assembly of packets, photocopying, printing, updating files, and distributing mail.)  \r\n\r\n-Assist customers in any way possible. Be aware of the daily events occurring in the office.  This can be found on the web (25LIVE) www.scheduling.wpi.edu.\r\n-Receive incoming calls; answer questions, take messages, transfer calls to appropriate parties.\r\n-Announce the arrival of appointments and/or walk-in's to the appropriate administrators.\r\n-Attend all scheduled meetings and training sessions.\r\n-Deliver all correspondence to other offices as needed.\r\n-Table sit in lobby to promote events in the Foisie Innovation Studio\r\n-Perform other duties as assigned by the administrative staff.",
        "requirements": "",
        "contact": "Adam Sears",
        "email": "asears@wpi.edu",
        "phone": "4638"
    },
    {
        "jobType": "Academic Year",
        "positionTitle": "Student Building Manager, WPI Innovation Studio",
        "department": "Innovation & Entrepreneurship",
        "location": "WPI Innovation Studio",
        "studentsRequired": 4,
        "hoursPerWeek": 4,
        "federalFunding": true,
        "jobDescription": "- The Building Manager serves as the primary supervisor of the building after normal working hours, seven days per week. \r\n\r\n-Open the building on designated school holidays and on weekends and secure the building at closing time every evening. Securing the building includes: entering classrooms, maker spaces, and meeting rooms to check for opened windows - securing them if need be. All lights in the building should be in the off position, all windows shut and locked, all doors - internal and external - shut and locked.\r\n\r\n-Provide supervision for and ensure students working in the maker spaces and other lab areas adhere to safety policies established for each specific room or area. Assist students, faculty and staff using the facility as needed.\r\n\r\n-Access web based 25 LIVE Pro (WPI events scheduling system) to find and list classes, meetings and event in the FOISIE Center each day and display it on the large screen TV in the FOISIE Center.\r\n\r\n-Use WebCheckOut system to loan out approved equipment, tools, white board markers and supplies, from the Information Desk. \r\n-Loan out teleconference phones as needed for meeting rooms.\r\n\r\n-Use Work Day to enter and submit work hours on your timesheet\r\n\r\n-Ensure pantry area is clean.\r\n\r\n-Serve as resource and assist students and staff in any way possible. Be aware of the daily events and academic classes occurring in the building. Be familiar with the physical layout of the FOISIE Innovation Studio and the rest of the campus so that you may direct unfamiliar individuals to their desired locations.\r\n\r\n-Review daily events schedule of classes, meetings and events to assess times that rooms will need to be opened for meetings, classes and events.\r\n\r\n-Operate multipurpose TVs/projection screens as requested.\r\n\r\n-Return to storage any technical equipment in meeting/function rooms once the area has been vacated and you are certain the equipment isn’t needed for other upcoming meetings or events.\r\n\r\n-Ensure tools are returned to their proper location after use.\r\n\r\n-Manage distribution of locker keys for moveable storage cabinets. Ensure that keys are given only to those authorized students whose names appear on the reservation for the storage cabinets.  \r\n\r\n-Use Canvas for makerspace related training and 3DprinterOS to verify access and process payments.\r\n\r\n-Use Odoo to process payments for makerspace related supplies purchased by community members. \r\n\r\n-Report and bring all lost and found items to Campus Police.\r\n\r\n-Complete the Building Manager Closing Form located on TechSync before the end of your shift.  \r\n\r\n-Wear your FOISIE Innovation Studio Staff shirt and set out your name plate at the main desk when working.  \r\n\r\n-Check your WPI email frequently, as Building Managers are added to the ficstaff@wpi.edu email alias which is used by all Building Managers and their supervisors to send information to Building Managers regarding the work schedule, changes, updates, mandatory meetings, trainings, special events, and other information required to perform duties as a FOISIE Innovation Studio Building Manager at the FOISIE Information Center Desk.\r\n\r\n-Other duties as assigned by your supervisor.  \r\n",
        "requirements": "",
        "contact": "Adam Sears",
        "email": "asears@wpi.edu",
        "phone": "4638"
    },
    {
        "jobType": "Academic Year",
        "positionTitle": "Research Fellow",
        "department": "Interactive Media & Game Development",
        "location": "Unity Hall",
        "studentsRequired": 2,
        "hoursPerWeek": 10,
        "federalFunding": false,
        "jobDescription": "This is a part of a research project in System Engineering and Sustainability that uses digital simulation to study the impact of modifying public transportation policies. As a team of game/simulator developers, we are responsible for building a traffic simulator that visualize the impact to environment and community over time.",
        "requirements": "Proficiency in C#, Unity 3D. Experience with using Unity 3D in building 2D games. Basic understanding of 2D shader. Prefer having some background knowledge in casual inference and system dynamics",
        "contact": "Robert Dempski",
        "email": "rdempski@wpi.edu",
        "phone": "4193"
    },
    {
        "jobType": "Academic Year",
        "positionTitle": "Assistant Photographer",
        "department": "Marketing & Communications",
        "location": "Boynton Hall",
        "studentsRequired": 1,
        "hoursPerWeek": 10,
        "federalFunding": false,
        "jobDescription": "The Office of Marketing Communications is seeking an Assistant Photographer to aid in the capturing of activities across campus for social media platforms and other print and digital communications. The Assistant Photographer will work closely with the multimedia/social media team and head photographer. The ideal candidate should have availability on some days, nights, and weekends. The Assistant Photographer may work closely with the in-house photographer as an assistant on headshot days and select WPI Journal shoots. In this role, you should be able to work collaboratively within a team and independently for most shoots. This role requires dependable communication skills with the head of the multimedia team. ",
        "requirements": "",
        "contact": "Jacleen (Becker) LeMay",
        "email": "jaci@wpi.edu",
        "phone": "5043"
    },
    {
        "jobType": "Academic Year",
        "positionTitle": "office Assistant",
        "department": "Mathematical Sciences",
        "location": "Sh303",
        "studentsRequired": 1,
        "hoursPerWeek": 5,
        "federalFunding": true,
        "jobDescription": "Help with general office operations+tiding the office . Knowledge of latex typing a plus.",
        "requirements": "Self starter.Flexible hours (to be negotiated)",
        "contact": "Mayer Humi",
        "email": "mhumi@wpi.edu",
        "phone": "5213"
    },
    {
        "jobType": "Academic Year",
        "positionTitle": "Office Assistant",
        "department": "Mathematical Sciences",
        "location": "Stratton Hall",
        "studentsRequired": 3,
        "hoursPerWeek": 8,
        "federalFunding": false,
        "jobDescription": "Assist with day-to-day functions of the Math Department office, such as greeting students, faculty and visitors, answering incoming calls, photocopying, filing. Also, assist department staff with any projects necessary. Some lifting may be needed on occasion. For consideration, please send cover letter and resume\r\n\r\n ",
        "requirements": "",
        "contact": "Rhonda Podell",
        "email": "rpodell@wpi.edu",
        "phone": "6342"
    },
    {
        "jobType": "Academic Year",
        "positionTitle": "Manufacturing Labs Assistant",
        "department": "Mechanical Engineering",
        "location": "WB 107 and HL005",
        "studentsRequired": 6,
        "hoursPerWeek": 5,
        "federalFunding": true,
        "jobDescription": "Basic responsibilities include:\r\n-Greet students as they enter the lab\r\n-Help answer questions about the facility\r\n-Perform tasks as assigned by the Operations Manager or Sr. Instructional Laboratory Technician\r\n-Conduct machine maintenance\r\n-Assist students, staff and faculty with machine use (laser cutter, 3-D printer, CNC machines)\r\n-Give tours of the facility(s)",
        "requirements": "No experience required.  We will provide training on all necessary equipment.",
        "contact": "Ian Anderson",
        "email": "washburnstaff@wpi.edu",
        "phone": "0"
    },
    {
        "jobType": "Academic Year",
        "positionTitle": "programmer",
        "department": "Mechanical Engineering",
        "location": "flexible",
        "studentsRequired": 1,
        "hoursPerWeek": 8,
        "federalFunding": false,
        "jobDescription": "Creating software for use in WPI's Surface Metrology Lab based on special algorithms for cutting edge analyses of large data sets.",
        "requirements": "programming skills",
        "contact": "Christopher Aldrich Brown",
        "email": "brown@wpi.edu",
        "phone": "5627"
    },
    {
        "jobType": "Academic Year",
        "positionTitle": "Research Assistants in Surface Metrology",
        "department": "Mechanical Engineering",
        "location": "243 WB",
        "studentsRequired": 12,
        "hoursPerWeek": 5,
        "federalFunding": false,
        "jobDescription": "Undergraduate research opportunities are available in the Surface Metrology Laboratory. Work study positions and ISPs (independent study projects) are available too.  \r\n\r\nThis lab has developed breakthrough technologies that are used in laboratories around the world.  Assist in organizing and conducting research, running the lab, and organizing workshops and exhibitions. \r\n\r\nThe research can lead to co-authoring scientific and technical publications and will help to build resumes and recommendations for grad school and jobs.  \r\n\r\nThe Surface Metrology Lab is dedicated to measuring and understanding surface roughness, or topographies, how roughness is created, and how roughness influences performance.  \r\n\r\nThe lab collaborates with other industrial and academic laboratories around the world and can provide international project opportunities.\r\n",
        "requirements": "Students of all years and all majors are encouraged to apply.",
        "contact": "Prof. Christopher Brown",
        "email": "brown@wpi.edu",
        "phone": "5627"
    },
    {
        "jobType": "Academic Year",
        "positionTitle": "Assistant Supply Tech - Federal Work study required.",
        "department": "Military Science",
        "location": "Daniels Hall",
        "studentsRequired": 4,
        "hoursPerWeek": 4,
        "federalFunding": true,
        "jobDescription": "The Primary duty is to organize and label apparel and equipment. Additional duties will include issuing articles to cadets, receiving returned articles from cadets and maintaining cadet records accurately. Complete 100% physical inventory counts as required. Assist in preparing a 100% ADP inventory and location identifier log.",
        "requirements": "Applicants MUST have FEDERAL WORK STUDY funding. Applicants must be reliable and have a positive customer service attitude, good communication skills and posses great attention to detail.",
        "contact": "Sharon Parry",
        "email": "saparry@wpi.edu",
        "phone": "5268"
    },
    {
        "jobType": "Academic Year",
        "positionTitle": "Public Affairs Office Assistant, Federal Work study required",
        "department": "Military Science",
        "location": "Daniels Hall",
        "studentsRequired": 1,
        "hoursPerWeek": 6,
        "federalFunding": true,
        "jobDescription": "The Army ROTC department seeks a responsible, dependable, detail-oriented student to serve as a Public Affairs Office Assistant. The individual will update the department’s various social media pages, and web content to increase visibility and engagement with the Army ROTC audience on a weekly basis. The individual will also update the department’s alumni database, answer phones, file documents and perform other basic office functions. ",
        "requirements": "Student must be proficient and methodical in Microsoft Excel and Word as well as Facebook page and Instagram development. The successful candidate will have excellent verbal and written communication skills, a customer service orientation, a positive attitude and be a reliable, mature, responsible, independent thinker who demonstrates flexibility and good problem-solving skills. This position is only available for federally funded work study students.",
        "contact": "Kim Adams",
        "email": "Kimmarie@wpi.edu",
        "phone": "5268"
    },
    {
        "jobType": "Academic Year",
        "positionTitle": "Student Sustainability Intern",
        "department": "Office of Sustainability",
        "location": "On-campus - Location tbd",
        "studentsRequired": 1,
        "hoursPerWeek": 5,
        "federalFunding": false,
        "jobDescription": "The Student Sustainability Intern will be assigned projects that may involve various sustainability-themed work, such as analyzing operations data, evaluating transportation options, overseeing Student Sustainability Ambassadors’ efforts, editing Office of Sustainability website, entering data for external surveys, assisting with the bike share program, or general outreach and community  engagement.  Student would be expected to meet with Director Sustainability and/or the Manager of Energy and Sustainability on a regular basis. The work location depends on topic.",
        "requirements": "The student must be a self-starter, have an understanding of sustainability issues, and be enthusiastic, well-organized and detail-oriented. Strong data analysis skills, computer skills, and written and verbal communication skills are important.  Training will be provided as needed.  ",
        "contact": "Paul Mathisen",
        "email": "gr-green@wpi.edu",
        "phone": "5343"
    },
    {
        "jobType": "Academic Year",
        "positionTitle": "Sustainability Intern",
        "department": "Office of Sustainability",
        "location": "On-campus - Location tbd",
        "studentsRequired": 1,
        "hoursPerWeek": 5,
        "federalFunding": false,
        "jobDescription": "Student Sustainability Intern will be assigned projects that may involve various sustainability-themed work, such as analyzing operations data, evaluating transportation options, overseeing Student Sustainability Ambassadors’ efforts, editing Office of Sustainability website, entering data for external surveys, assisting with the bike share program, or general outreach and community  engagement.  Student would be expected to meet with Director Sustainability and/or the Manager of Energy and Sustainability on a regular basis. The work location depends on topic.",
        "requirements": "Student must be a self-starter, have an understanding of sustainability issues, and be enthusiastic, well-organized and detail-oriented. Strong data analysis skills, computer skills, and written and verbal communication skills are important.  Training will be provided as needed.  ",
        "contact": "Paul Mathisen",
        "email": "gr-green@wpi.edu",
        "phone": "5343"
    },
    {
        "jobType": "Academic Year",
        "positionTitle": "Equipment Room Assistants",
        "department": "Physical Education & Athletics",
        "location": "Harrington Auditorium ",
        "studentsRequired": 20,
        "hoursPerWeek": 5,
        "federalFunding": true,
        "jobDescription": "Equipment Room Assistants provide quality customer service, equipment/facility maintenance, uniform repair, and laundry services to teams.\r\n",
        "requirements": "great attitude, friendly, willing to help, and wants to have fun ",
        "contact": "Chris Robertson",
        "email": "crobertson@wpi.edu",
        "phone": "5100"
    },
    {
        "jobType": "Academic Year",
        "positionTitle": "Event Workers",
        "department": "Physical Education & Athletics",
        "location": "Sports & Recreation Center Complex",
        "studentsRequired": 5,
        "hoursPerWeek": 5,
        "federalFunding": true,
        "jobDescription": "Game workers are an essential part of every athletic event at WPI. The responsibilities of the game workers include, but are not limited to: operating the scoreboard, announcing, statisticians, line judges, ball retrievers, ticket sales and assist with game set-up/breakdown.",
        "requirements": "Good Attitude, friendly, willing to help, and wants to have fun.  Willing to work evenings and weekends.",
        "contact": "Danielle Rafuse",
        "email": "drafuse@wpi.edu",
        "phone": "5873"
    },
    {
        "jobType": "Academic Year",
        "positionTitle": "Men's Basketball Student Manager",
        "department": "Physical Education & Athletics",
        "location": "Harrington/Rec Center",
        "studentsRequired": 1,
        "hoursPerWeek": 10,
        "federalFunding": false,
        "jobDescription": "Attend practice and assist with score keeping, stats, practice setup, film setup, and practice drills. Film games and assist with game responsibilities. Assist in coordinating travel logistics. Assist with Alumni events.",
        "requirements": "",
        "contact": "Jeffrey Robinson",
        "email": "jrobinson@wpi.edu",
        "phone": "5147"
    },
    {
        "jobType": "Academic Year",
        "positionTitle": "Office Assistant/Student Manager- Softball",
        "department": "Physical Education & Athletics",
        "location": "PERA 230",
        "studentsRequired": 2,
        "hoursPerWeek": 6,
        "federalFunding": true,
        "jobDescription": "Help with organizational aspects and day to day operations of the program, and also in season game day assignments. Charting, filming as examples on game day. Aiding with clinic organization, spring trip plans, and small assignments and promotion/and game day marketing potential.",
        "requirements": "Email savvy, word, excel ability. Photoshop/photo editing preferred. Timely, fast learner, and fun environment. Softball knowledge preferred.",
        "contact": "Whitney Goldstein",
        "email": "Wgoldstein@wpi.edu",
        "phone": "5729"
    },
    {
        "jobType": "Academic Year",
        "positionTitle": "Office Assistant",
        "department": "Physics",
        "location": "Olin Hall 119",
        "studentsRequired": 3,
        "hoursPerWeek": 10,
        "federalFunding": true,
        "jobDescription": "Office Assistant in Physics Department",
        "requirements": "",
        "contact": "Payton Wilkins",
        "email": "plwilkins@wpi.edu",
        "phone": "5322"
    },
    {
        "jobType": "Academic Year",
        "positionTitle": "Student Office Assistant ",
        "department": "Projects & Registrar's Office",
        "location": "Unity Hall Room 435",
        "studentsRequired": 6,
        "hoursPerWeek": 5,
        "federalFunding": true,
        "jobDescription": "The Registrar's Office, which is located on the fourth floor of Unity Hall (Room 435), is looking for additional students to assist with registering students for classes, answering the telephones and helping with the front counter. Responsibilities will also include filing, light computer work and special projects. We only need you 4 to 5 hours per week (you choose your hours), and one-on-one training is provided by our other seasoned work study students. Once work studies start working in our office, they usually continue until they graduate, an indication of our great team and pleasant work environment. ",
        "requirements": "",
        "contact": "Klea Cuni",
        "email": "kcuni@wpi.edu",
        "phone": "5211"
    },
    {
        "jobType": "Academic Year",
        "positionTitle": "Residential Services Student Worker",
        "department": "Residential Services",
        "location": "East Hall- 1st Floor",
        "studentsRequired": 2,
        "hoursPerWeek": 3,
        "federalFunding": true,
        "jobDescription": "QUALIFICATIONS: --Knowledge of and/or willingness to learn the operations and services of the Residential Services Office and ID office. --Knowledge of office procedures, typing and computer skills, effective customer relations and communication skills. DUTIES INCLUDE: --Create WPI ID Cards for customers (follow all procedures with ID creation process) --Assist with clerical work as assigned by professional staff. (Clerical work includes, but is not limited to: computer data entry, word processing, filing, coordinating mailings, collating/assembly of packets, photocopying, printing, updating files, and distributing mail.) --Be familiar with office procedures for various routine tasks. --Be familiar with expectations regarding the quality of work. --Greet customers as they come into East Hall, and assist in any way possible. Be aware of the daily events occurring in the office. --Announce the arrival of appointments and/or walk-ins to the appropriate administrators. --Attend all scheduled meetings and training sessions. --Perform other duties as assigned by the administrative staff.",
        "requirements": "Federal Work Study Required",
        "contact": "Catherine Flayhan",
        "email": "cflayha@wpi.edu",
        "phone": "X5645"
    },
    {
        "jobType": "Academic Year",
        "positionTitle": "Research Assistant ",
        "department": "Robotics Engineering",
        "location": "AK 228",
        "studentsRequired": 1,
        "hoursPerWeek": 20,
        "federalFunding": false,
        "jobDescription": "Assist Faculty and Research Team with SysML modeling, developing interfaces between SysML and robotics virtual environment and communications. Students with SYS 501 completed will be preferred, students with some exposure to using systems modeling language (SysML). The student will assist faculty research team in developing research reports, configuration management of modeling artifacts, model using SysML and develop research papers. A working knowledge of FMEA and Fault tree is a must. ",
        "requirements": "SYS 501 completed, SysML knowledge, Graduate Student ",
        "contact": "SHAMSNAZ Shamshuddin VIRANI",
        "email": "ssvirani@wpi.edu",
        "phone": "8314848"
    },
    {
        "jobType": "Academic Year",
        "positionTitle": "Research Assistant ",
        "department": "Robotics Engineering",
        "location": "AK 228",
        "studentsRequired": 1,
        "hoursPerWeek": 20,
        "federalFunding": false,
        "jobDescription": "Assist Faculty and Research Team with SysML modeling, developing interfaces between SysML and robotics virtual environment and communications. Students with SYS 501 completed will be preferred, students with some exposure to using systems modeling language (SysML). The student will assist faculty research team in developing research reports, configuration management of modeling artifacts, model using SysML and develop research papers. A working knowledge of FMEA and Fault tree is a must. ",
        "requirements": "SYS 501 completed, SysML knowledge, Graduate Student ",
        "contact": "SHAMSNAZ Shamshuddin VIRANI",
        "email": "ssvirani@wpi.edu",
        "phone": "8314848"
    },
    {
        "jobType": "Academic Year",
        "positionTitle": "Research assistant",
        "department": "School of Business",
        "location": "WPI or Remote",
        "studentsRequired": 2,
        "hoursPerWeek": 15,
        "federalFunding": false,
        "jobDescription": "Research assistant (RA) position for WPI students with skills in multimedia content development and research interest in UX ($16/hour)\r\n \r\nWe have an opening for 1 or 2 students to work on an exciting and impactful NIH funded research project. This is a position that will begin as early as October 2022 and has the potential to continue until the end of the next academic year.\r\n \r\nAs a member of a multidisciplinary research team, students will contribute to the design and testing of a digital health intervention tool that is being developed to support individuals likely to experience perinatal depression. Our digital intervention is designed to screen, triage, and send tailored text messages with relevant video content designed to decrease the likelihood of depression in perinatal individuals at risk of a major depressive episode\r\n\r\nAs a member of the research team, students will participate in interviews with individuals who have lived experiences to determine their needs and expectations from this tool and to identify best ways to communicate (text, video, animation, etc.) the content embedded in the tool. The students will have an opportunity to gain experience in conducting User Experience (UX) research, developing and testing user personas, low fidelity prototypes (e.g., pen and paper story boards), and refining low-fidelity prototypes into final products by utilizing the multimedia/video production technologies and spaces (e.g., Scherer Video Recording Suite at the WPI Global Lab). These production ready components will be incorporated into our tool and tested via iterative UX studies.\r\n \r\nIf you are a student interested in understanding how technology and UX research is used in healthcare and you have experience working on multimedia technology and content development OR web based technology development OR low-code development platforms, send an email to bengisu@wpi.edu with your resume and any other supporting qualifying material including a cover letter to apply for the position. We will start processing applications immediately until the positions are filled.\r\n",
        "requirements": "",
        "contact": "Prof. Bengisu Tulu",
        "email": "bengisu@wpi.edu",
        "phone": "5184"
    },
    {
        "jobType": "Academic Year",
        "positionTitle": "Learning Sciences Program Assistant",
        "department": "Social Science & Policy Studies",
        "location": "Unity Hall",
        "studentsRequired": 2,
        "hoursPerWeek": 5,
        "federalFunding": true,
        "jobDescription": "Assist faculty of the program in SSPS (Ottmar and Shaw) with clerical, course, and research-related tasks. These tasks include, but are not limited to: scheduling meetings, assistance with course materials (designing, editing, copying, printing, data entry, research), assistance with research and grant materials (designing, editing, formatting, copying, printing, surveys,  data entry, research), assistance with LST and lab Webpages and social media, assist with design and ordering of program-related materials, and will coordinate with other CS faculty in the LST Program. Experience with and ability to learn MS Word, PowerPoint, web design, Excel, and Qualtrics are important. Experience with SPSS is a plus!",
        "requirements": "",
        "contact": "Erin Ottmar",
        "email": "erottmar@wpi.edu",
        "phone": "6096"
    },
    {
        "jobType": "Academic Year",
        "positionTitle": "Psychological & Cognitive Science Lab Assistant",
        "department": "Social Science & Policy Studies",
        "location": "Salisbury Labs 3rd Floor",
        "studentsRequired": 3,
        "hoursPerWeek": 10,
        "federalFunding": true,
        "jobDescription": "We invite federal work study students to assist with psychological science research projects. In this role, you will assist faculty with research lab-related tasks. These tasks include, but are not limited to: helping schedule weekly lab and MQP meetings, assist with monitoring and restocking lab supplies, helping design and edit research projects, helping run research participants, helping train research assistant on how to run different studies, help with data (e.g., data entry, data coding, and data analysis), and helping present the work conducted in the lab. Experience with and ability to learn MS Word, PowerPoint, Excel, and Qualtrics are important. Experience with SPSS is a plus! ",
        "requirements": "Assist with research lab-related tasks throughout the academic year. Must currently be eligible for federal work study. Experience with and ability to learn MS Word, PowerPoint, Excel, and Qualtrics are important. Experience with SPSS is a plus! ",
        "contact": "Professor Jeanine Skorinko",
        "email": "skorinko@wpi.edu",
        "phone": "5451"
    },
    {
        "jobType": "Academic Year",
        "positionTitle": "Psychological and Cognitive Science Program Assistant",
        "department": "Social Science & Policy Studies",
        "location": "Salisbury Labs 3rd Floor",
        "studentsRequired": 1,
        "hoursPerWeek": 10,
        "federalFunding": true,
        "jobDescription": "Assist faculty of the program with clerical, course, and research-related tasks. These tasks include, but are not limited to: scheduling meetings, assistance with course materials (designing, editing, copying, printing, data entry, research), assistance with research and grant materials (designing, editing, copying, printing, putting on Qualtrics, coding open-ended responses, data entry, research), assistance with Psychological and Cognitive Sciences Webpage, assist with design and ordering of program-related materials, and be available to talk with students regarding the Psychological Sciences Minor or Major. Experience with and ability to learn MS Word, PowerPoint, Excel, and Qualtrics are important. Experience with SPSS is a plus! ",
        "requirements": "Assist with program-related tasks throughout the academic year. Must currently be eligible for federal work study.  Experience with and ability to learn MS Word, PowerPoint, Excel, and Qualtrics are important. Experience with SPSS is a plus! ",
        "contact": "Professor Jeanine Skorinko",
        "email": "skorinko@wpi.edu",
        "phone": "5451"
    },
    {
        "jobType": "Academic Year",
        "positionTitle": "Research Assistant ",
        "department": "Social Science & Policy Studies",
        "location": "100 Institute Rd",
        "studentsRequired": 1,
        "hoursPerWeek": 20,
        "federalFunding": false,
        "jobDescription": "Assist faculty of the program with clerical, and research-related tasks. These tasks include, but are not limited to: scheduling meetings, assistance with project management( taking meeting minutes, agenda, keeping records, tasks) assistance with research and grant materials (Literature Review, annotated bibliography, brainstorming), assistance with SMERL Lab webpage, Writing project reports, be available to talk with other project partners about lab research activities. Ideal student will have experience with and ability to learn MS Word, PowerPoint, Excel, and Qualtrics are important. Experience with SPSS  and SysML is a plus! Student can be Undergraduate or Graduate. ",
        "requirements": "",
        "contact": "Shamsnaz Virani Bhada",
        "email": "ssvirani@wpi.edu",
        "phone": "8314848"
    },
    {
        "jobType": "Academic Year",
        "positionTitle": "Research Assistant- Learning Sciences Research ",
        "department": "Social Science & Policy Studies",
        "location": "Unity Hall",
        "studentsRequired": 10,
        "hoursPerWeek": 5,
        "federalFunding": true,
        "jobDescription": "The Math Abstraction Play Learning and Embodiment (MAPLE) Lab designs and evaluates novel dynamic technologies in order to aid mathematical teaching and learning. Professor Ottmar invites Federal Work Study students to spend their work study hours assisting with the lab’s federal research projects. While working on the project you will have the opportunity to engage in the entire process of educational and psychological research in classrooms including content creation, experimental design, study implementation, and data analysis. You will also have opportunities to work with after school programs and teachers. People with programming, video, and design skills are also needed to develop cognitive lab experiments.  \r\n \r\nTo learn more about the position and projects, please visit https://sites.google.com/view/ed-psych-and-mathematics-learn/home or contact Erin Ottmar at erottmar@wpi.edu\r\n ",
        "requirements": "",
        "contact": "Erin Ottmar",
        "email": "erottmar@wpi.edu",
        "phone": "6096"
    },
    {
        "jobType": "Academic Year",
        "positionTitle": "HR Office Assistant (Federal Work Study Funds Required)",
        "department": "Talent and Inclusion",
        "location": "Boynton Hall",
        "studentsRequired": 10,
        "hoursPerWeek": 10,
        "federalFunding": true,
        "jobDescription": "Filing, answering phones, data entry, errands, etc.  Accuracy and attention to detail is vital. HR handles student, staff and faculty hiring employment related issues along with retirement and health benefits- all areas of great importance to the employees of WPI.",
        "requirements": "Microsoft office applications i.e. word, excel, power point, publisher courteous, professional demeanor phone skills a plus",
        "contact": "Christopher Benoit",
        "email": "cbenoit@wpi.edu",
        "phone": "6783"
    },
    {
        "jobType": "Academic Year",
        "positionTitle": "Alumni Relations Office Assistant - Federal Work Study Required",
        "department": "University Advancement",
        "location": "Higgins House",
        "studentsRequired": 3,
        "hoursPerWeek": 3,
        "federalFunding": true,
        "jobDescription": "The office assistant will provide staff support with day to day operation of the Office of Alumni Relations. General office practices, such as telephones, mail receipt, coordination of event supplies and bulk mail preparation. Additional assistance with alumni and student events. Training will be provided.",
        "requirements": "Customer service, team oriented attitude, reliability, creativity, good communication skills, attention to detail. Computer proficiency with MS Word/Excel and willingness to work with the public.",
        "contact": "Jenn Daigle",
        "email": "jldaigle@wpi.edu",
        "phone": "6089"
    },
    {
        "jobType": "Academic Year",
        "positionTitle": "University Advancement Email Specialist",
        "department": "University Advancement",
        "location": "85 Prescott St",
        "studentsRequired": 1,
        "hoursPerWeek": 8,
        "federalFunding": true,
        "jobDescription": "The University Advancement Email Specialist will assist the Advancement Digital Communication team with the creation of marketing emails that inspire constituents to become more deeply connected to WPI. \r\n\r\nJob responsibilities include:\r\n•\tFinding, editing and creating images for emails\r\n•\tBuilding emails in Marketing Cloud\r\n•\tReporting out on email analytics\r\n",
        "requirements": "",
        "contact": "Anna Dealy",
        "email": "ajdealy@wpi.edu",
        "phone": "6855"
    },
    {
        "jobType": "Summer",
        "positionTitle": "web developer / editor",
        "department": "Humanities & Arts",
        "location": "01606",
        "studentsRequired": 2,
        "hoursPerWeek": 8,
        "federalFunding": false,
        "jobDescription": "wed revisions for an online museum, WPI's Jazz History Database. Your good work will be reflected in our online presence.",
        "requirements": "basic php editing skills required; some basic web development experience is preferred, though most of this work will be adapting existing pages rather than building pages from scratch",
        "contact": "Ben Young",
        "email": "byoung2@wpi.edu",
        "phone": "4981"
    },
    {
        "jobType": "Summer",
        "positionTitle": "Research Assistant (undergraduate or graduate)",
        "department": "Mathematical Sciences",
        "location": "WPI",
        "studentsRequired": 1,
        "hoursPerWeek": 40,
        "federalFunding": false,
        "jobDescription": "This summer RA-ship is a part of the new DoE-sponsored program carried out by WPI in cooperation with the Oak Ridge National Laboratory. The RA will work on bringing together on a WPI Linux server two pieces of software: \r\n(a) a C++ code of an existing professional/commercial simulator (designed for modeling a wide array of scenarios and applications in EE) developed by a software company in Europe and brought in WPI using container technologies; \r\n(b) a neural network optimization procedure (WPI-born, implemented in MATLAB) controlling the simulator (a) for generation of data for optimization. \r\n     In the fall 2022, after successful combination of (a) and (b) in a solver-optimizer operating at the WPI Linux machine, the same work in their coupling will be repeated at High Performance Computing facilities at the ORNL. The RA will be invited to continue their work on the project at this next stage. Later stages of the project could include various topics, including the development of novel deep learning/neural network algorithms.\r\n     Collaboration with project partners: the work in coupling (a) and (b) will be done under direct guidance by their developers (at Dartmouth College, NH and QWED, Poland) and under supervision of the ORNL. \r\n     '40 h per week' above means that compensation for a full time job (within two months) is available. The actual work supported by this compensation can, however, spread over a longer period than two summer months. ",
        "requirements": "The position is most likely for a CS major, but students in other orientations who possess sufficient qualification in the related topics will be considered.",
        "contact": "Vadim Yakovlev",
        "email": "vadim@wpi.edu",
        "phone": "5495"
    }
]